奥点(广电云)php



<?php

$id = isset($_GET['id'])?$_GET['id']:'863';

$n = array(

'863' =>863,//中国传媒大学校园广播-有视频
'858' =>858, //恩施综合广播
'455' =>455,//FM106湘西人民广播电台
'457'=>457,//阜阳916
'470'=>470,//武邑广播电台
'639' =>639,//FM98.6福鼎广播电视台综合广播
'688' =>688, //沅陵人民广播电台
'488'=>488,//临沂都市广播
'489'=>489,//临沂综合广播
'490'=>490,//临沂音乐广播
'595'=>595,//安吉FM1001
'711'=>711,//巴中新闻综合广播
'710'=>710,//巴中交通旅游广播
'719'=>719,//临沂大学广播电台日常节目直播-12:10-12:30/18:00-19:00
'792'=>792,//绵竹广播电台直播
'796'=>796,//商水县音乐广播
'782'=>782,//布尔津调频93.8-音乐
'783'=>783,//闽侯广播电视台综合广播
'785'=>785,//FM104.0饶阳人民广播电台
'778'=>778,//藤县人民广播电台
'771'=>771,//曲沃人民广播电台FM106.4
'761'=>761,//人民广播电台
'801'=>801,//黄岩95.7
'806'=>806,//淄博市综合广播《12345市长在线》直播
'812'=>812,//宁静885-音乐
'817'=>817,//FM94.0新疆维吾尔自治区阿克苏地区-汉语
'817'=>817,//FM101.6新疆维吾尔自治区阿克苏地区-维语

);



$url = 'https://1812501212048408.cn-hangzhou.fc.aliyuncs.com/2016-08-15/proxy/node-api.online/node-api/radio/channelInfo?id='.$n[$id];

$ch = curl_init();

curl_setopt($ch, CURLOPT_URL, $url);

curl_setopt($ch, CURLOPT_RETURNTRANSFER, 1);

$data = curl_exec($ch);

curl_close($ch);

$playurl = json_decode($data)->data->hlsUrl;

header('location:'.$playurl);

//echo $playurl;

?>

[/hide]



